clear, clc, close all

% 龙格-库塔 用于解决非线性微分方程
% ode45 只能用于求解一阶微分方程，高阶微分方程需要转化为一阶再进行运算

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% y'-y=x,初始条件y(0)=1

% tspan = [0, 5];
% y0 = 1;
% opts = [];
% [x, y] = ode45(@ode, tspan, y0, opts);

% function dy = ode(x, y)
% 
% dy = x + y;
% 
% end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% y''-(1-y^2)y'+2y=0,初始条件为y(0)=2,y'(0)=0
% y''=(1-y^2)y'-2y y=y1 y'=y2
% y2'=(1-y1^2)y2-2y1

tspan = [0, 5];
y0 = [2, 0];
opts = [];
[x, y] = ode45(@ode, tspan, y0, opts);

plot(x,y);
grid

function dy = ode(~, y)
dy = zeros(2,1);
dy(1) = y(2);
dy(2) = (1 - y(1)^2) * y(2) - 2 * y(1);

end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%